{
    "format": "layers-model",
    "generatedBy": "keras v2.4.0",
    "convertedBy": "TensorFlow.js Converter v2.6.0",
    "modelTopology": {
        "keras_version": "2.4.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Model",
            "config": {
                "name": "functional_1",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                3,
                                320,
                                320
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "input"
                        },
                        "name": "input",
                        "inbound_nodes": []
                    },
                    {
                        "class_name": "ZeroPadding2D",
                        "config": {
                            "name": "728_pad",
                            "trainable": true,
                            "dtype": "float32",
                            "padding": [
                                [
                                    3,
                                    3
                                ],
                                [
                                    3,
                                    3
                                ]
                            ],
                            "data_format": "channels_first"
                        },
                        "name": "728_pad",
                        "inbound_nodes": [
                            [
                                [
                                    "input",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "728",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                7,
                                7
                            ],
                            "strides": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "data_format": "channels_first",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": false,
                            "kernel_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "728",
                        "inbound_nodes": [
                            [
                                [
                                    "728_pad",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "729",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                1
                            ],
                            "momentum": 0.8999999761581421,
                            "epsilon": 9.999999747378752e-06,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "729",
                        "inbound_nodes": [
                            [
                                [
                                    "728",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "730",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "730",
                        "inbound_nodes": [
                            [
                                [
                                    "729",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "ZeroPadding2D",
                        "config": {
                            "name": "731_pad",
                            "trainable": true,
                            "dtype": "float32",
                            "padding": [
                                [
                                    1,
                                    1
                                ],
                                [
                                    1,
                                    1
                                ]
                            ],
                            "data_format": "channels_first"
                        },
                        "name": "731_pad",
                        "inbound_nodes": [
                            [
                                [
                                    "730",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "731",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                3,
                                3
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_first"
                        },
                        "name": "731",
                        "inbound_nodes": [
                            [
                                [
                                    "731_pad",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "733",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                1
                            ],
                            "momentum": 0.8999999761581421,
                            "epsilon": 9.999999747378752e-06,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "733",
                        "inbound_nodes": [
                            [
                                [
                                    "731",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "734",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "734",
                        "inbound_nodes": [
                            [
                                [
                                    "733",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "735",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 128,
                            "kernel_size": [
                                1,
                                1
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_first",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": false,
                            "kernel_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "735",
                        "inbound_nodes": [
                            [
                                [
                                    "734",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "736",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                1
                            ],
                            "momentum": 0.8999999761581421,
                            "epsilon": 9.999999747378752e-06,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "736",
                        "inbound_nodes": [
                            [
                                [
                                    "735",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "737",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "737",
                        "inbound_nodes": [
                            [
                                [
                                    "736",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "ZeroPadding2D",
                        "config": {
                            "name": "738_pad",
                            "trainable": true,
                            "dtype": "float32",
                            "padding": [
                                [
                                    1,
                                    1
                                ],
                                [
                                    1,
                                    1
                                ]
                            ],
                            "data_format": "channels_first"
                        },
                        "name": "738_pad",
                        "inbound_nodes": [
                            [
                                [
                                    "737",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "738",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 32,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_first",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": false,
                            "kernel_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "738",
                        "inbound_nodes": [
                            [
                                [
                                    "738_pad",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Concatenate",
                        "config": {
                            "name": "739",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": 1
                        },
                        "name": "739",
                        "inbound_nodes": [
                            [
                                [
                                    "731",
                                    0,
                                    0,
                                    {}
                                ],
                                [
                                    "738",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "740",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                1
                            ],
                            "momentum": 0.8999999761581421,
                            "epsilon": 9.999999747378752e-06,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "740",
                        "inbound_nodes": [
                            [
                                [
                                    "739",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "741",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "741",
                        "inbound_nodes": [
                            [
                                [
                                    "740",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "742",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 128,
                            "kernel_size": [
                                1,
                                1
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_first",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": false,
                            "kernel_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "742",
                        "inbound_nodes": [
                            [
                                [
                                    "741",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "743",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                1
                            ],
                            "momentum": 0.8999999761581421,
                            "epsilon": 9.999999747378752e-06,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "743",
                        "inbound_nodes": [
                            [
                                [
                                    "742",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "744",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "744",
                        "inbound_nodes": [
                            [
                                [
                                    "743",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "ZeroPadding2D",
                        "config": {
                            "name": "745_pad",
                            "trainable": true,
                            "dtype": "float32",
                            "padding": [
                                [
                                    1,
                                    1
                                ],
                                [
                                    1,
                                    1
                                ]
                            ],
                            "data_format": "channels_first"
                        },
                        "name": "745_pad",
                        "inbound_nodes": [
                            [
                                [
                                    "744",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "745",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 32,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_first",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": false,
                            "kernel_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "745",
                        "inbound_nodes": [
                            [
                                [
                                    "745_pad",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Concatenate",
                        "config": {
                            "name": "746",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": 1
                        },
                        "name": "746",
                        "inbound_nodes": [
                            [
                                [
                                    "731",
                                    0,
                                    0,
                                    {}
                                ],
                                [
                                    "738",
                                    0,
                                    0,
                                    {}
                                ],
                                [
                                    "745",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "747",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                1
                            ],
                            "momentum": 0.8999999761581421,
                            "epsilon": 9.999999747378752e-06,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "747",
                        "inbound_nodes": [
                            [
                                [
                                    "746",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "748",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "748",
                        "inbound_nodes": [
                            [
                                [
                                    "747",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "749",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 128,
                            "kernel_size": [
                                1,
                                1
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_first",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": false,
                            "kernel_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "749",
                        "inbound_nodes": [
                            [
                                [
                                    "748",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "750",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                1
                            ],
                            "momentum": 0.8999999761581421,
                            "epsilon": 9.999999747378752e-06,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "750",
                        "inbound_nodes": [
                            [
                                [
                                    "749",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "751",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "751",
                        "inbound_nodes": [
                            [
                                [
                                    "750",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "ZeroPadding2D",
                        "config": {
                            "name": "752_pad",
                            "trainable": true,
                            "dtype": "float32",
                            "padding": [
                                [
                                    1,
                                    1
                                ],
                                [
                                    1,
                                    1
                                ]
                            ],
                            "data_format": "channels_first"
                        },
                        "name": "752_pad",
                        "inbound_nodes": [
                            [
                                [
                                    "751",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "752",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 32,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_first",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": false,
                            "kernel_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "752",
                        "inbound_nodes": [
                            [
                                [
                                    "752_pad",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Concatenate",
                        "config": {
                            "name": "753",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": 1
                        },
                        "name": "753",
                        "inbound_nodes": [
                            [
                                [
                                    "731",
                                    0,
                                    0,
                                    {}
                                ],
                                [
                                    "738",
                                    0,
                                    0,
                                    {}
                                ],
                                [
                                    "745",
                                    0,
                                    0,
                                    {}
                                ],
                                [
                                    "752",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "754",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                1
                            ],
                            "momentum": 0.8999999761581421,
                            "epsilon": 9.999999747378752e-06,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "754",
                        "inbound_nodes": [
                            [
                                [
                                    "753",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "755",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "755",
                        "inbound_nodes": [
                            [
                                [
                                    "754",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "756",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 128,
                            "kernel_size": [
                                1,
                                1
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_first",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": false,
                            "kernel_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
